Autodesk.Revit.DB.FillPattern.IsEqual(Autodesk.Revit.DB.FillPattern)
Check if the contents and the name of the fill pattern is the same as the name and contents of this fill pattern.
other:
The fill pattern to be compared.
Returns:
True for equal, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.FillPattern.SetFillGrids(System.Collections.Generic.IList{Autodesk.Revit.DB.FillGrid})
Set the fill grids in this fill pattern.
fillGrids:
The fill grids to be used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.FillPattern.SetFillGrid(System.Int32,Autodesk.Revit.DB.FillGrid)
Sets the fill grid.
gridIdx:
The index of the fill grid.
fillGrid:
The fill grid to be used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.FillPattern.Name
The name of the fill pattern.
Remarks:
The name of solid fill patterns cannot be changed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.FillPattern.#ctor(System.String,Autodesk.Revit.DB.FillPatternTarget,Autodesk.Revit.DB.FillPatternHostOrientation,System.Double,System.Double,System.Double)
Creates a simple crosshatch fill pattern based on the given name, angle, spacing, FillPatternTarget and FillPatternHostOrientation.
name:
The name.
target:
The fill pattern target.
orientation:
The fill pattern orientation.
angle:
The angle.
spacing1:
The spacing.
spacing2:
The spacing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.FillPattern.#ctor(System.String,Autodesk.Revit.DB.FillPatternTarget,Autodesk.Revit.DB.FillPatternHostOrientation,System.Double,System.Double)
Creates a simple hatch fill pattern based on the given name, angle, spacing, FillPatternTarget and FillPatternHostOrientation.
name:
The name.
target:
The fill pattern target.
orientation:
The fill pattern orientation.
angle:
The angle.
spacing1:
The spacing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.FillPattern.#ctor(System.String,Autodesk.Revit.DB.FillPatternTarget,Autodesk.Revit.DB.FillPatternHostOrientation)
Creates a fill pattern based on the given name, FillPatternTarget and FillPatternHostOrientation.
name:
The name.
target:
The fill pattern target.
orientation:
The fill pattern orientation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.FillPattern.#ctor(Autodesk.Revit.DB.FillPattern)
Constructs a new copy of the input FillPattern object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null